cases/branch_d/geom_c11/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
55296
(
-0.0073431431
-0.0066960953
-0.0060490476
-0.0054019998
-0.0066764764
-0.0060294287
-0.0053823809
-0.0047353331
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
576
(
-0.0076666667
-0.007
-0.0063333333
-0.0056666667
-0.005
-0.0043333333
-0.0036666667
-0.003
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
576
(
-0.0076666667
-0.007
-0.0063333333
-0.0056666667
-0.005
-0.0043333333
-0.0036666667
-0.003
...
)
;
    }
    heated_first_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
2304
(
-0.0073431429
-0.0066764762
-0.0060098095
-0.0053431429
-0.0046764762
-0.0040098095
-0.0033431429
-0.0026764762
...
)
;
    }
    blanket_back_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
2304
(
-0.0073431429
-0.0066764762
-0.0060098095
-0.0053431429
-0.0046764762
-0.0040098095
-0.0033431429
-0.0026764762
...
)
;
    }
    side_walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
4608
(
-0.0076764771
-0.0076764771
-0.0076764771
-0.0076764771
-0.0076764771
-0.0076764771
-0.0076764771
-0.0076764771
...
)
;
    }
}


// ************************************************************************* //
