cases/branch_d/geom_c11/0/k
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.00505;
boundaryField
{
    inlet { type fixedValue; value uniform 0.00505; }
    outlet { type inletOutlet; inletValue uniform 0.00505; value uniform 0.00505; }
    "(heated_first_wall|blanket_back_wall|side_walls)" { type kqRWallFunction; value uniform 0.00505; }
}
