cases/branch_d/geom_c11/0/nut
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet { type calculated; value uniform 0; }
    outlet { type calculated; value uniform 0; }
    "(heated_first_wall|blanket_back_wall|side_walls)" { type nutkWallFunction; value uniform 0; }
}
