cases/branch_d/geom_c11/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
    (0 -0.008 0.015)
    (0 -0.008 -0.015)
    (0 0.008 -0.015)
    (0 0.008 0.015)
    (0.01139011604 -0.005411809549 0.01539360506)
    (0.01346104623 -0.005411809549 -0.01453483039)
    (0.01346104623 0.01058819045 -0.01453483039)
    (0.01139011604 0.01058819045 0.01539360506)
    (0.02272589018 -0.003 0.01657254234)
    (0.02685787021 -0.003 -0.01314154087)
    (0.02685787021 0.013 -0.01314154087)
    (0.02272589018 0.013 0.01657254234)
    (0.03395323976 -0.0009289321881 0.01853118719)
    (0.04012655608 -0.0009289321881 -0.01082677877)
    (0.04012655608 0.01507106781 -0.01082677877)
    (0.03395323976 0.01507106781 0.01853118719)
    (0.04501859945 0.0006602540378 0.02126019496)
    (0.05320379935 0.0006602540378 -0.007601587772)
    (0.05320379935 0.01666025404 -0.007601587772)
    (0.04501859945 0.01666025404 0.02126019496)
    (0.05586917673 0.001659258263 0.02474654564)
    (0.06602720886 0.001659258263 -0.003481355155)
    (0.06602720886 0.01765925826 -0.003481355155)
    (0.05586917673 0.01765925826 0.02474654564)
    (0.06645320383 0.002 0.02897360595)
    (0.07853560452 0.002 0.001514261572)
    (0.07853560452 0.018 0.001514261572)
    (0.06645320383 0.018 0.02897360595)
    (0.07672018465 0.001659258263 0.0339212087)
    (0.09066930914 0.001659258263 0.007361428468)
    (0.09066930914 0.01765925826 0.007361428468)
    (0.07672018465 0.01765925826 0.0339212087)
    (0.08662113576 0.0006602540378 0.03956574905)
    (0.1023704332 0.0006602540378 0.01403224887)
    (0.1023704332 0.01666025404 0.01403224887)
    (0.08662113576 0.01666025404 0.03956574905)
    (0.09610881998 -0.0009289321881 0.04588029704)
    (0.1135831509 -0.0009289321881 0.0214948965)
    (0.1135831509 0.01507106781 0.0214948965)
    (0.09610881998 0.01507106781 0.04588029704)
    (0.1051379719 -0.003 0.05283472617)
    (0.1242539668 -0.003 0.02971376729)
    (0.1242539668 0.013 0.02971376729)
    (0.1051379719 0.013 0.05283472617)
    (0.1136655136 -0.005411809549 0.06039585704)
    (0.1343319706 -0.005411809549 0.03864964923)
    (0.1343319706 0.01058819045 0.03864964923)
    (0.1136655136 0.01058819045 0.06039585704)
    (0.1216507606 -0.008 0.06852761574)
    (0.1437690807 -0.008 0.04825990951)
    (0.1437690807 0.008 0.04825990951)
    (0.1216507606 0.008 0.06852761574)
    (0.1290556153 -0.01058819045 0.07719120589)
    (0.1525202727 -0.01058819045 0.05849869787)
    (0.1525202727 0.005411809549 0.05849869787)
    (0.1290556153 0.005411809549 0.07719120589)
    (0.1358447496 -0.013 0.08634529374)
    (0.160543795 -0.013 0.06931716533)
    (0.160543795 0.003 0.06931716533)
    (0.1358447496 0.003 0.08634529374)
    (0.1419857726 -0.01507106781 0.09594620542)
    (0.1678013676 -0.01507106781 0.08066369732)
    (0.1678013676 0.0009289321881 0.08066369732)
    (0.1419857726 0.0009289321881 0.09594620542)
    (0.1474493857 -0.01666025404 0.1059481353)
    (0.1742583649 -0.01666025404 0.09248415986)
    (0.1742583649 -0.0006602540378 0.09248415986)
    (0.1474493857 -0.0006602540378 0.1059481353)
    (0.1522095221 -0.01765925826 0.1163033644)
    (0.1798839806 -0.01765925826 0.1047221579)
    (0.1798839806 -0.001659258263 0.1047221579)
    (0.1522095221 -0.001659258263 0.1163033644)
    (0.1562434714 -0.018 0.1269624882)
    (0.1846513753 -0.018 0.1173193043)
    (0.1846513753 -0.002 0.1173193043)
    (0.1562434714 -0.002 0.1269624882)
    (0.1595319877 -0.01765925826 0.1378746525)
    (0.1885378036 -0.01765925826 0.1302154984)
    (0.1885378036 -0.001659258263 0.1302154984)
    (0.1595319877 -0.001659258263 0.1378746525)
    (0.1620593816 -0.01666025404 0.1489877955)
    (0.1915247237 -0.01666025404 0.1433492129)
    (0.1915247237 -0.0006602540378 0.1433492129)
    (0.1620593816 -0.0006602540378 0.1489877955)
    (0.1638135951 -0.01507106781 0.1602488969)
    (0.1935978851 -0.01507106781 0.1566577872)
    (0.1935978851 0.0009289321881 0.1566577872)
    (0.1638135951 0.0009289321881 0.1602488969)
    (0.1647862587 -0.013 0.1716042302)
    (0.1947473966 -0.013 0.1700777265)
    (0.1947473966 0.003 0.1700777265)
    (0.1647862587 0.003 0.1716042302)
    (0.1649727319 -0.01058819045 0.1829996194)
    (0.1949677741 -0.01058819045 0.1835450047)
    (0.1949677741 0.005411809549 0.1835450047)
    (0.1649727319 0.005411809549 0.1829996194)
    (0.1643721252 -0.008 0.1943806976)
    (0.1942579661 -0.008 0.1969953698)
    (0.1942579661 0.008 0.1969953698)
    (0.1643721252 0.008 0.1943806976)
);
blocks
(
    hex (1 5 6 2 0 4 7 3) (4 24 24) simpleGrading (1 1 1)
    hex (5 9 10 6 4 8 11 7) (4 24 24) simpleGrading (1 1 1)
    hex (9 13 14 10 8 12 15 11) (4 24 24) simpleGrading (1 1 1)
    hex (13 17 18 14 12 16 19 15) (4 24 24) simpleGrading (1 1 1)
    hex (17 21 22 18 16 20 23 19) (4 24 24) simpleGrading (1 1 1)
    hex (21 25 26 22 20 24 27 23) (4 24 24) simpleGrading (1 1 1)
    hex (25 29 30 26 24 28 31 27) (4 24 24) simpleGrading (1 1 1)
    hex (29 33 34 30 28 32 35 31) (4 24 24) simpleGrading (1 1 1)
    hex (33 37 38 34 32 36 39 35) (4 24 24) simpleGrading (1 1 1)
    hex (37 41 42 38 36 40 43 39) (4 24 24) simpleGrading (1 1 1)
    hex (41 45 46 42 40 44 47 43) (4 24 24) simpleGrading (1 1 1)
    hex (45 49 50 46 44 48 51 47) (4 24 24) simpleGrading (1 1 1)
    hex (49 53 54 50 48 52 55 51) (4 24 24) simpleGrading (1 1 1)
    hex (53 57 58 54 52 56 59 55) (4 24 24) simpleGrading (1 1 1)
    hex (57 61 62 58 56 60 63 59) (4 24 24) simpleGrading (1 1 1)
    hex (61 65 66 62 60 64 67 63) (4 24 24) simpleGrading (1 1 1)
    hex (65 69 70 66 64 68 71 67) (4 24 24) simpleGrading (1 1 1)
    hex (69 73 74 70 68 72 75 71) (4 24 24) simpleGrading (1 1 1)
    hex (73 77 78 74 72 76 79 75) (4 24 24) simpleGrading (1 1 1)
    hex (77 81 82 78 76 80 83 79) (4 24 24) simpleGrading (1 1 1)
    hex (81 85 86 82 80 84 87 83) (4 24 24) simpleGrading (1 1 1)
    hex (85 89 90 86 84 88 91 87) (4 24 24) simpleGrading (1 1 1)
    hex (89 93 94 90 88 92 95 91) (4 24 24) simpleGrading (1 1 1)
    hex (93 97 98 94 92 96 99 95) (4 24 24) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 3 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (97 96 99 98)
        );
    }
    heated_first_wall
    {
        type wall;
        faces
        (
        (0 3 7 4)
        (4 7 11 8)
        (8 11 15 12)
        (12 15 19 16)
        (16 19 23 20)
        (20 23 27 24)
        (24 27 31 28)
        (28 31 35 32)
        (32 35 39 36)
        (36 39 43 40)
        (40 43 47 44)
        (44 47 51 48)
        (48 51 55 52)
        (52 55 59 56)
        (56 59 63 60)
        (60 63 67 64)
        (64 67 71 68)
        (68 71 75 72)
        (72 75 79 76)
        (76 79 83 80)
        (80 83 87 84)
        (84 87 91 88)
        (88 91 95 92)
        (92 95 99 96)
        );
    }
    blanket_back_wall
    {
        type wall;
        faces
        (
        (1 5 6 2)
        (5 9 10 6)
        (9 13 14 10)
        (13 17 18 14)
        (17 21 22 18)
        (21 25 26 22)
        (25 29 30 26)
        (29 33 34 30)
        (33 37 38 34)
        (37 41 42 38)
        (41 45 46 42)
        (45 49 50 46)
        (49 53 54 50)
        (53 57 58 54)
        (57 61 62 58)
        (61 65 66 62)
        (65 69 70 66)
        (69 73 74 70)
        (73 77 78 74)
        (77 81 82 78)
        (81 85 86 82)
        (85 89 90 86)
        (89 93 94 90)
        (93 97 98 94)
        );
    }
    side_walls
    {
        type wall;
        faces
        (
        (1 0 4 5)
        (2 6 7 3)
        (5 4 8 9)
        (6 10 11 7)
        (9 8 12 13)
        (10 14 15 11)
        (13 12 16 17)
        (14 18 19 15)
        (17 16 20 21)
        (18 22 23 19)
        (21 20 24 25)
        (22 26 27 23)
        (25 24 28 29)
        (26 30 31 27)
        (29 28 32 33)
        (30 34 35 31)
        (33 32 36 37)
        (34 38 39 35)
        (37 36 40 41)
        (38 42 43 39)
        (41 40 44 45)
        (42 46 47 43)
        (45 44 48 49)
        (46 50 51 47)
        (49 48 52 53)
        (50 54 55 51)
        (53 52 56 57)
        (54 58 59 55)
        (57 56 60 61)
        (58 62 63 59)
        (61 60 64 65)
        (62 66 67 63)
        (65 64 68 69)
        (66 70 71 67)
        (69 68 72 73)
        (70 74 75 71)
        (73 72 76 77)
        (74 78 79 75)
        (77 76 80 81)
        (78 82 83 79)
        (81 80 84 85)
        (82 86 87 83)
        (85 84 88 89)
        (86 90 91 87)
        (89 88 92 93)
        (90 94 95 91)
        (93 92 96 97)
        (94 98 99 95)
        );
    }
);
mergePatchPairs ();
